# GetClosedShell Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
EnergyAnalysisSpace..::..GetClosedShell Method
EnergyAnalysisSpace Class See Also
---
Gets the collection of polygons that form a closed shell. This method returns a collection of polyloops (planar polygons) that defines an enclosed volume measured by interior bounding surfaces.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public IList<Polyloop> GetClosedShell()
```

Visual Basic
---
```text
Public Function GetClosedShell As IList(Of Polyloop)
```

Visual C++
---
```text
public:
IList<Polyloop^>^ GetClosedShell()
```

# ### Return Value
the collection of polygons that form a closed shell.
# See Also
EnergyAnalysisSpace Class
Autodesk.Revit.DB.Analysis Namespace